# Import Libraries

In [1]:
import pandas as pd
import numpy as np

# Create Data

In [14]:
df = pd.DataFrame({
    'customer_id': [1, 2, 3, 4]
    , 'name': ['Alice', 'Bob', 'Charlie', 'David']
    , 'city': ['NYC','LA','Chicago','Houston']
})

df2 = pd.DataFrame({
    'order_id': [101, 102, 103, 104, 105]
    , 'customer_id' : [1,2,3,4,5]
    , 'amount': [100,150,200,75,300]
})

# Merge

Left Join

In [15]:
left_merge = pd.merge(df, df2, on='customer_id', how='left')
display(left_merge)

   customer_id     name     city  order_id  amount
0            1    Alice      NYC       101     100
1            2      Bob       LA       102     150
2            3  Charlie  Chicago       103     200
3            4    David  Houston       104      75

Right Join

In [16]:
right_merge = pd.merge(df, df2, on='customer_id', how='right')
display(right_merge)

   customer_id     name     city  order_id  amount
0            1    Alice      NYC       101     100
1            2      Bob       LA       102     150
2            3  Charlie  Chicago       103     200
3            4    David  Houston       104      75
4            5      NaN      NaN       105     300

Inner Join

In [17]:
inner_merge = pd.merge(df, df2, on='customer_id', how='inner')
display(inner_merge)

   customer_id     name     city  order_id  amount
0            1    Alice      NYC       101     100
1            2      Bob       LA       102     150
2            3  Charlie  Chicago       103     200
3            4    David  Houston       104      75

Outer Join

In [18]:
outer_merge = pd.merge(df, df2, on='customer_id', how='outer')
display(outer_merge)

   customer_id     name     city  order_id  amount
0            1    Alice      NYC       101     100
1            2      Bob       LA       102     150
2            3  Charlie  Chicago       103     200
3            4    David  Houston       104      75
4            5      NaN      NaN       105     300

# Concat

In [20]:
df_concat = pd.concat([df, df2], axis=0, ignore_index=True, sort=False)
display(df_concat)

   customer_id     name     city  order_id  amount
0            1    Alice      NYC       NaN     NaN
1            2      Bob       LA       NaN     NaN
2            3  Charlie  Chicago       NaN     NaN
3            4    David  Houston       NaN     NaN
4            1      NaN      NaN     101.0   100.0
5            2      NaN      NaN     102.0   150.0
6            3      NaN      NaN     103.0   200.0
7            4      NaN      NaN     104.0    75.0
8            5      NaN      NaN     105.0   300.0

In [21]:
df_concat = pd.concat([df, df2], axis=1, ignore_index=True, sort=False)
display(df_concat)

     0        1        2    3  4    5
0  1.0    Alice      NYC  101  1  100
1  2.0      Bob       LA  102  2  150
2  3.0  Charlie  Chicago  103  3  200
3  4.0    David  Houston  104  4   75
4  NaN      NaN      NaN  105  5  300

# Join

In [27]:
df_join = df.join(df2.set_index('customer_id'), on='customer_id', how='right')
display(df_join)

     customer_id     name     city  order_id  amount
0.0            1    Alice      NYC       101     100
1.0            2      Bob       LA       102     150
2.0            3  Charlie  Chicago       103     200
3.0            4    David  Houston       104      75
NaN            5      NaN      NaN       105     300